{
  "base_model_name_or_path": "FlagAlpha/Atom-7B-Chat",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "target_modules": [
    "W_pack",
    "down_proj",
    "o_proj",
    "gate_proj",
    "up_proj"
  ],
  "task_type": "CAUSAL_LM"
}